/* 
  Localizable.strings
  ownCloudSDK

  Created by Felix Schwarz on 03.03.18.
  Copyright © 2018 ownCloud GmbH. All rights reserved.
*/

/* Item property names */
"itemProperty.lastModified" = "Última modificação";
"itemProperty.isFavorite" = "Favorito";
"itemProperty.localAttributes" = "Atributos locais";

/* Item policy */
"Available Offline" = "Disponível Offline";

/* Cellular Switches */
"Allow cellular access" = "Permitir acesso do celular ";

/* Connection Progress */
"Connecting…" = "Conectando...";
"Authenticating…" = "Autenticando...";
"Error" = "Erro";
"Fetching user information…" = "Buscando informações do usuário...";
"Connected" = "Conectado";

"Retrieving thumbnail…" = "Recuperando miniatura…";

"Cancel" = "Cancelar";
"Proceed" = "Prosseguir";
"OK" = "OK";

/* Database upgrades */
"Upgrading database…" = "Atualizando banco de dados... ";

/* Connection setup */
"Insecure HTTP URL" = "HTTP URL Inseguro";
"The URL you provided uses the HTTP rather than the HTTPS scheme. If you continue, your communication will not be encrypted." = "O URL fornecido por você usa o HTTP em vez do esquema HTTPS. Se você continuar, sua comunicação não será criptografada.";

"Insecure HTTP URL forbidden" = "HTTP inseguro URL proibida";
"The URL you provided uses the HTTP rather than the HTTPS scheme, so your communication would not be encrypted." = "O URL que você forneceu usa o esquema HTTP, e não o HTTPS, logo sua comunicação não será criptografada.";

/* Connection status */
"Offline" = "Desconectado";
"Offline (no WiFi connection)" = "Desconectado (sem conexão WiFi)";
"Server down for maintenance" = "Servidor inativo para manutenção";
"Network unavailable" = "Rede indisponível";
"Online" = "Conectado";
"Previous token refresh attempts indicated an invalid refresh token." = "As tentativas anteriores de atualização do token indicaram um refresh_token inválido. ";
"Server returns status %ld" = "O servidor retorna ao status  %ld";

/* Copies */
"copy" = "copiar";

/* Delete */
"%@ changed on the server. Really delete it?" = "%@ mudou no servidor. Realmente deletar?";
"%@ has changed on the server since you requested its deletion." = "%@ mudou no servidor desde que você solicitou sua exclusão.";
"Delete" = "Excluir";

"%@ couldn't be deleted" = "%@ não pôde ser excluído";
"Please check if you have sufficient permissions to delete %@." = "Por favor, verifique se você tem permissões suficientes para excluir %@.";

/* Move/Rename/Copy */
"Operation forbidden" = "Operação proibida";
"%@ can't be copied to %@." = "%@ não pode ser copiado para %@.";
"%@ can't be moved to %@." = "%@ não pode ser movido para %@.";

"%@ not found" = "%@ não encontrado";
"%@ wasn't found at %@." = "%@ não foi encontrado em %@.";

"The target directory %@ doesn't seem to exist." = "O diretório de destino %@ parece não existir.";

"%@ already exists" = "%@ já existe";
"Couldn't copy %@ to %@, because an item called %@ already exists there." = "Não foi possível copiar %@ para %@,porque um item chamado %@ já existe lá.";
"Couldn't move %@ to %@, because an item called %@ already exists there." = "Não foi possível mover %@ para %@, porque um item chamado %@ já existe lá.";

"Insufficient permissions" = "Permissões insuficientes";
"%@ can't be copied to %@." = "%@ não pode ser copiado para %@.";
"%@ can't be moved to %@." = "%@ não pode ser movido para %@.";

"%@ not found on the server" = "%@ não foi encontrado no servidor";
"%@ may have been renamed, moved or deleted remotely." = "%@ pode ter sido renomeado, movido ou excluído remotamente.";

"Error copying %@" = "Erro ao copiar %@";
"Error moving %@" = "Erro ao mover %@";

"Renaming %@ to %@…" = "Renomeando %@ para %@…";
"Moving %@ to %@…" = "Movendo %@ para %@…";
"Copying %@ to %@…" = "Copiando %@ para %@…";

/* Upload */
"Another item named %@ already exists in %@." = "Outro item chamado %@ já existe em %@.";
"Not enough space left on the server to upload %@." = "Não há espaço suficiente no servidor para fazer o envio de  %@.";
"Uploads to this folder are not allowed." = "O envio para esta pasta não é permitido. ";
"Replace" = "Substituir ";
"Keep both" = "Manter ambos";

/* Download */
"Downloading %@…" = "Baixando %@…";
"\"%@\" has been modified locally" = "\"%@\" foi modificado localmente ";
"A modified, unsynchronized version of \"%@\" is present on your device. Downloading the file from the server will overwrite it and modifications be lost." = "Uma versão modificada e não sincronizada de  \"%@\" está presente em seu dispositivo. Baixar o arquivo do servidor irá sobrescrevê-lo e as modificações serão perdidas. ";
"Invalid checksum" = "Checksum inválido ";
"The downloaded file's checksum does not match the checksum provided by the server." = "A soma de verificação do arquivo baixado não corresponde à soma de verificação fornecida pelo servidor. ";
"File modified locally" = "Arquivo modificado localmente ";
"\"%@\" was modified locally before the download completed." = "\"%@\" foi modificado localmente antes da conclusão de baixar o arquivo. ";
"Couldn't download %@" = "Não foi possível baixar %@";
"The contents of the file on the server has changed since initiating download - or the file is no longer available on the server." = "O conteúdo do arquivo no servidor mudou desde o início da tarefa de baixar o arquivo - ou o arquivo não está mais disponível no servidor. ";

/* Create folder */
"Creating folder %@…" = "Criando a pasta %@…";

/* Delete */
"Deleting %@…" = "Excluindo %@…";

/* Retrieving file list */
"Retrieving file list for %@…" = "Recuperando lista de arquivos para %@…";

/* Status */
"Pending" = "Pendente";
"Running" = "Executando";
"Failed" = "Falhou";
"Waiting for user" = "Esperando pelo usuário ";
"Waiting for metadata refresh" = "Aguardando atualização de metadados ";
"Waiting to retry (%ld of %ld)" = "Esperando para tentar novamente  (%ld de %ld)";

/* Update */
"\"%@\" metadata for %@ couldn't be updated" = "\"%@\" metadados para %@ não puderam ser atualizados";
"Update failed with status code %d" = "Falha na atualização com o código de erro  %d";
"Error updating %@ metadata" = "Erro atualizando %@ metadados";

/* Logging */
"Standard error output" = "Saída de erro padrão";
"Log file" = "Arquivo de Log";
"Log HTTP requests and responses" = "Registrar solicitações e respostas HTTP";

/* Certificate checks */
"Certificate changed" = "Certificado alterado ";

/* Errors */
"Server doesn't seem to support any authentication method supported by this app." = "O servidor não parece suportar nenhum método de autenticação suportado por este aplicativo.";
"This server runs an unsupported version (%@). Version %@ or later is required by this app." = "Este servidor roda uma versão não suportada ( %@ ). Versão %@ ou superior, é requerida para rodar este aplicativo.";

/* DAV Errors */
// OCDAVErrorServiceUnavailable
"Server down for maintenance." = "Servidor desativado para manutenção.";
// OCDAVErrorNotFound
"Resource not found." = "Recurso não encontrado. ";

/* OC Errors */
"%@ (error %ld, %@)" = "%@ (erro %ld, %@)";
"%@ (error %ld)" = "%@ (erro %ld)";

// OCErrorInternal
"Internal error." = "Erro interno.";

// OCErrorInsufficientParameters
"Insufficient parameters." = "Parâmetros insuficientes.";

// OCErrorAuthorizationFailed
"Authorization failed." = "Falha na autorização.";

// OCErrorAuthorizationRedirect
"Authorization failed because the server returned a redirect. Authorization may be successful when retried with the redirect URL." = "A autorização falhou porque o servidor retornou um redirecionamento. A autorização pode ser bem-sucedida quando você tentar novamente com o URL de redirecionamento.";

// OCErrorAuthorizationNoMethodData
"Authorization failed because no secret data was set for the authentication method." = "A autorização falhou porque nenhum dado secreto foi configurado para o método de autenticação.";

// OCErrorAuthorizationMissingData
"Authorization failed because data was missing from the secret data for the authentication method." = "A autorização falhou porque faltavam dados dos dados secretos para o método de autenticação.";

// OCErrroAuthorizationCancelled
"Authorization was cancelled by the user." = "A autorização foi cancelada pelo usuário.";

// OCErrorRequestURLSessionTaskConstructionFailed
"Construction of URL Session Task failed." = "A construção da Tarefa de Sessão de URL falhou.";

// OCErrorNewerVersionExists
"A newer version already exists." = "Uma versão mais nova já existe.";

// OCErrorRequestCancelled
"Request was cancelled." = "Pedido cancelado.";

// OCErrorRequestRemovedBeforeScheduling
"Request was removed before scheduling." = "A solicitação foi removida antes do agendamento.";

// OCErrorRequestServerCertificateRejected
"Request was cancelled because the server certificate was rejected." = "A solicitação foi cancelada porque o certificado do servidor foi rejeitado.";

// OCErrorRequestDroppedByURLSession
"Request was dropped by the NSURLSession." = "A solicitação foi descartada pela NSURLSession.";

// OCErrorRequestCompletedWithError
"Request completed with error." = "Solicitação concluída com erro.";

// OCErrorRequestURLSessionInvalidated
"Request couldn't be scheduled because the underlying URL session has been invalidated." = "A solicitação não pôde ser agendada porque a sessão de URL subjacente foi invalidada.";

// OCErrorException
"An exception occured." = "Uma exceção ocorreu.";

// OCErrorResponseUnknownFormat
"Response was in an unknown format." = "A resposta estava em um formato desconhecido.";

// OCErrorServerDetectionFailed
"Server detection failed, i.e. when the server at a URL is not an ownCloud instance." = "A detecção do servidor falhou, ou seja, quando o servidor em uma URL não é uma instância do ownCloud.";

// OCErrorServerTooManyRedirects
"Server detection failed because of too many redirects." = "A detecção do servidor falhou devido a muitos redirecionamentos.";

// OCErrorServerBadRedirection
"Server redirection to bad/invalid URL." = "Redirecionamento de servidor para URL errado/inválido.";

// OCErrorServerVersionNotSupported
"This server version is not supported." = "Esta versão do servidor não é suportada.";

// OCErrorServerNoSupportedAuthMethods
"Server doesn't seem to support any authentication method supported by this app." = "O servidor não parece suportar nenhum método de autenticação suportado por este aplicativo.";

// OCErrorCertificateInvalid
"The certificate is invalid or contains errors" = "O certificado é inválido ou contém erros";

// OCErrorCertificateMissing
"No certificate was returned for a request despite this being a HTTPS connection (should never occur in production, but only if you forgot to provide a certificate during simulated responses to HTTPS requests)." = "Nenhum certificado foi retornado para uma solicitação, apesar de esta ser uma conexão HTTPS (nunca deve ocorrer em produção, mas somente se você esqueceu de fornecer um certificado durante respostas simuladas a solicitações HTTPS).";

// OCErrorFeatureNotSupportedForItem
"This feature is not supported for this item." = "Este recurso não é suportado para este item.";

// OCErrorFeatureNotSupportedByServer
"This feature is not supported for this server (version)." = "Este recurso não é suportado para este (versão) servidor.";

// OCErrorFeatureNotImplemented
"This feature is currently not implemented" = "Este recurso não está atualmente implementado";

// OCErrorItemNotFound
"The targeted item has not been found." = "O item de destino não foi encontrado.";

// OCErrorItemDestinationNotFound
"The destination item has not been found." = "O item de destino não foi encontrado.";

// OCErrorItemChanged
"The targeted item has changed." = "O item referenciadoado foi alterado.";

// OCErrorItemInsufficientPermissions
"The action couldn't be performed on the targeted item because the client lacks permissions." = "A ação não pôde ser executada no item de destino porque o cliente não tem permissões.";

// OCErrorItemOperationForbidden
"The operation on the targeted item is not allowed." = "A operação no item de destino não é permitida.";

// OCErrorItemAlreadyExists
"There already is an item at the destination of this action." = "Já existe um item no destino desta ação.";

// OCErrorItemNotAvailableOffline
"Item not available offline." = "Item não disponível quando desconectado.";

// OCErrorFileNotFound:
"File not found." = "Arquivo não encontrado.";

// OCErrorCancelled
"The operation was cancelled." = "A operação foi cancelada.";

// OCErrorOutdatedCache
"An operation failed due to outdated cache information." = "Uma operação falhou devido a informações de cache desatualizadas.";

// OCErrorRunningOperation
"A running operation prevents execution." = "Uma outra operação em execução impede a execução.";

// OCErrorShareUnauthorized:
"Not authorized to access shares." = "Não autorizado a acessar compartilhamentos.";

// OCErrorShareUnavailable
"Shares are unavailable." = "Os compartilhamentos não estão indisponíveis.";

// OCErrorShareItemNotADirectory:
"Item is not a directory." = "O item não é um diretório.";

// OCErrorShareItemNotFound
"Item not found." = "Item não encontrado.";

// OCErrorShareNotFound
"Share not found." = "Compartilhamento não encontrado.";

// OCErrorShareUnknownType
"Unknown share type." = "Tipo de compartilhamento desconhecido.";

// OCErrorSharePublicUploadDisabled
"Public upload was disabled by the administrator." = "O envio de arquivo público foi desativado pelo administrador.";

// OCErrorNotAvailableOffline
"Not available offline." = "Não disponível quando desconectado. ";

// OCErrorAuthorizationRetry
"Authorization needs to be retried." = "A autorização precisa ser tentada novamente. ";

// OCErrorItemPolicyRedundant
"Another item policy of the same kind already includes the item, making the addition of this item policy redundant." = "Outra política de itens do mesmo tipo já inclui o item, tornando redundante a adição desta política de itens. ";

// OCErrorItemPolicyMakesRedundant
"Other item policies of the same kind covering subsets of this item policy become redundant by the addition of this item policy." = "Outras políticas de itens do mesmo tipo, cobrindo subconjuntos desta política de itens, tornam-se redundantes com a adição desta política de itens. ";

// OCErrorUnnormalizedPath
"The provided path is not normalized." = "O caminho fornecido não está normalizado. ";

// OCErrorPrivateLinkInvalidFormat
"Private link format invalid." = "Formato de linque privado inválido. ";

// OCErrorPrivateLinkResolutionFailed
"Resolution of private link failed." = "A resolução do linque privado falhou. ";

// OCErrorAuthorizationMethodNotAllowed
"Authentication method not allowed. Re-authentication needed." = "Método de autenticação não permitido. Re-autenticação necessária. ";

// OCErrorAuthorizationMethodUnknown
"Authentication method unknown." = "Método de autenticação desconhecido. ";

// OCErrorServerConnectionValidationFailed
"Connection validation failed." = "A validação da conexão falhou. ";

// OCErrorAuthorizationClientRegistrationFailed
"Client registration failed." = "O registro do cliente falhou. ";

// OCErrorAuthorizationNotMatchingRequiredUserID
"The logged in user is not matching the required user ID." = "O usuário conectado não corresponde ao ID de usuário necessário. ";
"You logged in as user %@, but must log in as user %@. Please retry." = "Você efetuou login como usuário %@, mas deve efetuar login como usuário %@. Por favor tente novamente. ";
"Login as user %@ required. Please retry." = "É necessário fazer login como usuário %@ .  Por favor tente novamente.";

// OCErrorDatabaseMigrationRequired
"Database upgrade required. Please open the app to perform the upgrade." = "É necessário atualizar o banco de dados. Abra o aplicativo para realizar a atualização.";

// OCErrorHostUpdateRequired
"Bookmark created with a newer app version. Please update the app." = "Marcador criado com uma versão mais recente do aplicativo. Atualize o aplicativo. ";

/* Diagnostic */
"Files" = "Arquivos";
"Folders" = "Pastas";
"Total Items" = "Total de Itens";
"Removed Items" = "Itens Removidos ";
"Scheduled folder scans" = "Verificações programadas de pasta";
"Sync Record ID"  = "ID de registro de sincronização ";
"State" = "Estado";
"In progress since" = "Em andamento desde ";
"Origin Process" = "Processo de Origem ";
"Origin Process Valid" = "Processo de origem válido ";
"Timestamp" = "Carimbo de tempo ";
"Lane ID" = "ID da pista ";
"Local ID" = "ID local ";
"Action ID" = "ID da ação ";
"Process Sync Records" = "Registros de Sincronização de Processo ";
"Reschedule" = "Reprogramar ";
"Deschedule (remove)" = "Desmarcar (remover) ";
"Action" = "Ação";
"Wait Conditions" = "Condições de Espera ";
"Events" = "Eventos";
"Class" = "Classe";
"Identifier" = "Identificador ";
"Localized Description" = "Descrição Localizada ";
"Database size" = "Tamanho do banco de dados ";
"Thumbnail database size" = "Tamanho do banco de dados de miniaturas ";
"Vacuum" = "Vácuo ";
